#NumPy演習
#ベクトルの定義
import numpy as np
v1 = np.array([1, 2, 3])
v2 = np.array([[4],
              [-1],
              [6]])


#行列の定義
m1 = np.array([[3, -2], 
               [7, 1]])
m2 = np.array([[3, -2, 0, 1], 
               [7, 1, -1, 2], 
               [4, -5, 1, 3]])


#ベクトルの作成
#すべての要素を0で初期化したベクトルを作成
v1 = np.zeros((1, 2))
print(v1)    #[[0. 0.]]
print(v1[0])    #[0. 0.]

#すべての要素を1で初期化したベクトルを作成
v2 = np.ones((4, 1))

print(v2)    #[[1.]                                      
             # [1.]                                      
             # [1.]                                      
             # [1.]]


#行列の作成
#単位行列の作成
m1 = np.eye(3)
print(m1)    #[[1. 0. 0.]                                  
             # [0. 1. 0.]                                  
             # [0. 0. 1.]]

#正方行列でない対角行列
m2 = np.eye(3, 4)
print(m2)    #[[1. 0. 0. 0.]                                  
             # [0. 1. 0. 0.]                                  
             # [0. 0. 1. 0.]]


#基本情報の取得(形状、次元、データ型、要素数)
a = np.array([2, 3, 4])
b = np.array([[1.2, 3.5, 5.1], [-0.3, 1.1, -4.5]])
#形状
print(a.shape)    #(3,)
print(b.shape)    #(2, 3)
#次元
print(a.ndim)    #1
print(b.ndim)    #2
#データ型
print(a.dtype)    #int64
print(b.dtype)    #float64
#要素数
print(a.size)    #3
print(b.size)    #6


#インデックスとスライシング
#1から13まで2つ飛ばしする
a = np.arange(1, 13, 2)    #array([1, 3, 5, 7, 9, 11]) 
#3番目から5番目までの要素
print(a[2: -1])    #[5 7 9]
